Repository: mozilla-l10n/mt-training-data
Catalog: ha/ha_pontoon.tmx
Source language: en_us
Languages: ha

source: <p> SUMO is now using Gravatars as avatars. You must change your Gravatar on gravatar.com. </p> <p> It can take a few minutes for the avatar change to take effect. You may need to wait a few minutes and reload the page to see your new Gravatar. </p>
ha: <p> SUMO yanzu yana amfani da Gravatars a matsayin hoto. Dole ka canja Gravatar ka a gravatar.com. </p> <p> Zai iya ɗaukar mintina kaɗan kafin canjin zanen ya fara aiki. Kana bukatar saurarawa mintina kaɗan kuma ka sake loda shafin domin ganin sabuwar Gravatar. </p>

source: <p>This article may be out of date.</p> <p> An important change has been made to the English article on which this is based. Until this page is updated, you might find this helpful: <a href="%(url)s">%(title)s</a> </p>
ha: <p>Wannan maƙala na iya zama tsohuwa.</p> <p> An samar da wani mahimmin canji ga maƙalar Turanci wadda daga ita aka sami wannan. Har sai an sabunta wannan shafi, za ka iya samun wannan ya taimaka: <a href="%(url)s">%(title)s</a> </p>

source: {q} | {product} Support Forum
ha: {q} | {product} Dandalin Tallafi

source: Question
ha: Tambaya

source: Question:
ha: Tambaya:

source: Question date
ha: Kwanan watan tambaya

source: Question details
ha: Cikakken bayanin tambaya

source: Question owner
ha: Mai mallakar tambaya

source: Questions
ha: Tambayoyi

source: Questions responded to within X hours
ha: Tambayoyin da aka amsa cikin awanni X

source: Questions solved
ha: An amsa tambayoyi

source: Question tools
ha: Kayayyakin tambaya

source: Quickstart Guide
ha: Jagoran Mai farawa cikin Sauri

source: Quote
ha: Ambato

source: Quote previous message...
ha: Ambaci saƙon da ya gabata...

source: Read and save web pages in a clutter-free, reader-friendly view
ha: Karanta kuma ka ajiye shafukan yanar gizo a cikin rashin cunkoso, da kallo sauƙin tafiyrwa

source: Reader View and List
ha: Kallo na mai karatu da Jeri

source: Readied for localization:
ha: Shiryayye domin fassara:

source: Readied for localization by:
ha: Shiryayye domin fassara daga:

source: Read message
ha: Karanta saƙo

source: Read Message
ha: Karanta Saƙwanni

source: read more
ha: daɗa karatu

source: Read, send and organize emails
ha: Karanta, aika da shirya imel

source: Read Sent Message
ha: Karanta Saƙwanni da aka Aika

source: Read this answer in context
ha: Karanta wannan amsa a matsayinta

source: Read this for some help to get started
ha: Karanta wannan domin taimako domin ka fara

source: Ready for localization
ha: Shiri domin fassarawa

source: Ready for localization:
ha: Shiryawa domin fassara:

source: Recent answers to %s
ha: Amsoshin kwanan nan zuwa %s

source: Recent awardees
ha: Masu karɓar kyauta na baya-bayan nan

source: Recent English Changes
ha: Canje-canjen Turanci na Kwana-kwanan nan

source: Recently approved updates
ha: Sabuntawar da aka amince da ita ta kwanan nan

source: Recently Awarded
ha: Wanda aka bayar kwana-kwanan nan

source: Recently awarded badges
ha: Bajoji da aka bayar kwanan nan

source: Recently unanswered
ha: Wanda ba'a amsa ba na kwana-kwanan nan

source: Recently updated questions
ha: Tambayoyin da aka sabunta kwana-kwanan nan

source: Recently updated questions tagged %s
ha: Tambayoyin da aka sabunta kwana-kwanan nan da aka yiwa alama %s

source: Recently updated threads about %s
ha: Tattaunawar da aka daɗa kimanin %s

source: Recent posts in %s
ha: Aike-aike na kwana-kwanan nan a %s

source: Recent Revisions
ha: Nazarce-nazarce na kwana-kwanan nan

source: [Recursive inclusion of "%s"]
ha: [Sake maimaitawa da ya haɗa da "%s"]

source: (Redirected from <a href="{href}">{title}</a>)
ha: (Turawa daga <a href="{href}">{title}</a>)

source: Redirecting
ha: Turawa

source: Redirects
ha: Turawa

source: Re: {forum} - {thread}
ha: Tunasarwa: {forum} - {thread}

source: Refresh
ha: Sabunta

source: Refresh Firefox
ha: Sabunta Firefox

source: Regards, <br />The SUMO team.
ha: Wassalam, <br />Ƙungiyar SUMO.

source: Regards, The SUMO team
ha: Wassalam, Ƙungiyar SUMO

source: Register or sign in
ha: Yi rijista ko kuma ka shiga

source: Register or Sign In
ha: Yi rijista ko ka shiga

source: Register to be a Contributor
ha: Yi rijista domin zama Mai Bayar da Gudun mawa

source: registration profile
ha: tarihin yin rijista

source: registration profiles
ha: tarihe-taihen yin rijista

source: Rejected
ha: An ƙi amincewa

source: Related
ha: Masu dangantaka

source: Related documents:
ha: Daftarori masa alaƙa:

source: Related products
ha: Sauran kayayyaki

source: Related to the Lightning add-on for Calendar
ha: Dangantaka da abin daɗi na Fitila domin Kalanda

source: Release Notes
ha: Saki rubutu

source: Relevance
ha: Dacewa

source: Relevant to
ha: Dacewa zuwa

source: Relevant to:
ha: Dacewa zuwa ga:

source: Remove contributor
ha: Cire mai bayar da gudun mawa

source: Remove Contributor
ha: Cire Mai bayar da Gudun mawa

source: Remove contributor | {document}
ha: Cire mai bayar da gudun mawa | {document}

source: Remove leader
ha: Cire jagora

source: Remove member
ha: Cire ɗan ƙungiya

source: Remove {role}
ha: Cire {role}

source: Remove tweets that aren't really about Firefox or don't need a reply
ha: Cire tweets waɗan da haƙiƙa ba su shafi firefox ba ko basa bukatar amsa

source: Remove user from contributors
ha: Cire mai amfani daga masu bayar da gudun mawa

source: Remove user from group
ha: Cire mai amfani daga ƙungiya

source: Remove user from leaders
ha: Cire jagora daga shugabanni

source: Remove user from locale editors
ha: Cire mai amfani daga masu gyara na wuri

source: Remove user from locale leaders
ha: Gire mai amfani daga shugabannin wuri

source: Remove user from locale reviewers
ha: Cire mai nazari daga cikin masu nazari na wuri

source: Replies
ha: Amsoshi

source: reply
ha: amsoshi

source: Reply
ha: Amsa

source: Reply...
ha: Amsa...

source: Reply Preview
ha: Misalin Amsa

source: Reply-to is empty
ha: Bubu komai a Amsa-zuwa-ga

source: Reply to thread: {title}
ha: Bayar da amsa ga tattunawa: {title}

source: Report this
ha: Bayar da rahoton wannan

source: Request type not recognized.
ha: Ba'a gane nau'in nema ba.

source: Required. 30 characters or fewer. Letters, digits and ./- only.
ha: An bukata. Haruffa 30 ko ƙasa. Baƙaƙe, lambobi da ./- kawai.

source: Re: %s
ha: Tunasarwa: %s

source: Resend account confirmation email
ha: Sake aika imel na tabbatar da asusu

source: Resend confirmation email
ha: Sake aika imel na tabbatarwa

source: Responded
ha: Waɗanda aka bayar da amsa

source: % Responded in 24 hours
ha: An bayar da amsa % a awanni 24

source: Responded in 24 hours
ha: An bayar da amsa a awanni 24

source: % Responded in 72 hours
ha: An bayar da amsa % a awanni 72

source: Responded in 72 hours
ha: An bayar da amsa a awanni 72

source: Respond to the tweet!
ha: Bayar da amsa ga tweet!

source: Response editor
ha: Amsoshin mai gyara

source: Response preview
ha: Misalin amsoshi

source: Responses
ha: Amsoshi

source: Results
ha: Sakamako

source: Results for: {query}
ha: Sakamako domin: {query}

source: Retrieve username
ha: Dawo da sunan mai amfani

source: Retrieve Username
ha: Dawo da Sunan mai amfani

source: Reveal password to check that it's right
ha: Nuna kalmar wucewa domin duba cewa dai dai ta ke

source: Reviewed
ha: An sake nazari

source: Reviewed:
ha: An yi nazari:

source: Reviewed by:
ha: Nazari daga:

source: %(reviewer)s has approved the revision to the document %(document_title)s.
ha: %(reviewer)s sun tabbatar da nazarin bayanin %(document_title)s.

source: %(reviewer)s has approved your revision to the document %(document_title)s.
ha: %(reviewer)s sun yarda da nazarinka na daftari %(document_title)s.

source: %(reviewer)s has reviewed your revision to the document %(document_title)s.
ha: %(reviewer)s sun duba nazarinka na daftari %(document_title)s.

source: Reviewing Revision {id} by {user}
ha: Sake duba Nazari {id} daga {user}

source: Reviewing Translation {id} in {language} by {user}
ha: Nazarin Fassara {id} a {language} daga {user}

source: Review Needed
ha: Akwai Bukatar Nazari

source: Review Needed: {comment}
ha: Akwai bukatar Nazari: {comment}

source: Review Process
ha: Hanyar Nazari

source: Review Revision
ha: Sake duba Nazari

source: Review Revision {id} | {document}
ha: Sake duba Nazari {id} | {document}

source: Review Revision of {title}
ha: Sake duba Nazari na {title}

source: [Reviews Pending: %s] SUMO needs your help!
ha: [Reviews Pending: %s] SUMO na bukatar taimakonka!

source: Review this revision
ha: Sake nazarin wannan nazari

source: Review Translation
ha: Nazarin Fassara

source: Review Translation {id} | {document}
ha: Nazarin Fassara {id} | {document}

source: Review Translation of {title}
ha: Nazarin Fassara ta {title}

source: Revision
ha: Nazari

source: Revision Comment: {comment}
ha: Sharhin Nazari: {comment}

source: Revision Content
ha: Abin ciki na Nazari

source: Revision History | {document}
ha: Nazarin Tarihi | {document}

source: Revision history for:
ha: Tarihin nazari domin:

source: Revision id:
ha: Id na Nazari:

source: Revision {id} by {user} on {date}
ha: Nazari daga {id} {user} a ranar {date}

source: Revision Information
ha: Bayanin Nazari

source: Revision {n} | {t} | {c}
ha: Nazari {n} | {t} | {c}

source: Revision {num}
ha: Nazari {num}

source: Revision {num}:
ha: Nazari {num}:

source: Revision rendered html:
ha: Nazari ya zama html:

source: Revision %s
ha: Nazari %s

source: Revision source:
ha: Tushen nazari:

source: Revision Source
ha: Tushen Nazari

source: said
ha: faɗi

source: salt
ha: gishiri

source: Save changes
ha: Ajiye canje-canje

source: Save description
ha: Ajiye kwatance

source: Save image
ha: Ajiye hoto

source: Save Question
ha: Ajiye Tambaya

source: Save, share and sync
ha: Ajiye, raba da saitawa

source: Save, share and synchronize content with other devices
ha: Ajiye, raba da saita abubuwan ciki tare da sauran na'urori

source: Save the world
ha: Ceci duniya

source: Save the world from the comfort of your couch
ha: Ceci duniya kana zaune cikin jin daɗi a kan kujera

source: %s characters remaining
ha: Haruffa %s suka yi saura

source: Search and navigate easily with these essential features
ha: Bincika kuma ka gewaya cikin sauƙi tare da waɗan nan siffofi masu mahimmanci

source: Search Clickthrough Rate
ha: Bincika adadin Clickthrough

source: Search for a user...
ha: Nemo mai amfani...

source: Search for common responses
ha: Nemo amsoshi game-gari

source: Search for documents...
ha: Neman daftarori...

source: Search Gallery
ha: Neman Hoto

source: Search in forum
ha: Nema a dandali

source: Search is temporarily unavailable. Please try again in a few minutes.
ha: Babu nema zuwa wani gajeren lokaci. Sake jarrabawa nan wasu mintina kaɗan.

source: Search Mozilla Support
ha: Nemi Tallafin Mozilla

source: Search results summary:
ha: Taƙaitaccen sakamakon bincike:

source: Search result summary:
ha: Nemi taƙaitaccen bayanin sakamako:

source: Search result summary in {locale}:
ha: Taƙaitaccen sakamakon bincike a {locale}:

source: Search the Discussion Forums
ha: Nema na Dandalin Tattaunawa

source: Search the Knowledge Base
ha: Nema na Tushen Ilimi

source: Search the Mozilla Support Knowledge Base and Support Forum.
ha: Nemi Tushen Ilimi na Tallafin Mozilla da Dandalin Tallafi.

source: Search the Support Questions
ha: Nema na Tambayoyin Tallafi

source: Search Unavailable
ha: Ba'a sami Abin nema ba

source: See <a href="%(url)s">the history</a> to base your edit on an existing unreviewed revision.
ha: Kalli <a href="%(url)s">tarihin</a> domin saka gyaranka a kan abu na yanzu da ba'a nazari ba.

source: See All
ha: Kalli Duka

source: See all available SUMO badges
ha: Kalli duk bajunan SUMO da ake da su

source: See all the details:
ha: Kalli cikakken bayani:

source: See all the details...
ha: Kalli duk bayanai...

source: See also:
ha: Kalli Duka:

source: See the comment:
ha: Kalli sharhin:

source: See the data
ha: Kalli bayanin

source: See what you can do to help
ha: Duba abin da za ka yi domin taimakawa

source: See your question here:
ha: Kalli tambayoyinka a nan:

source: Select a language to translate to:
ha: Zaɓi yaren da za'a fassara zuwa cikinsa:

source: Select by Locale
ha: Zaɓi dangane da Wuri

source: Select language
ha: Zaɓi yare

source: Select language | {document}
ha: Zaɓi yare | {document}

source: Seller will not provide support
ha: Mai sayawarwa ba zai bayar da tallafi ba

source: Send
ha: Aika

source: Send emails for private messages
ha: Aika imel domin saƙwanni na ƙashin kai

source: {sender} sent you the following message:
ha: {sender} ya aiko maka wannan saƙon:

source: Send password reset link
ha: Aiko da haɗi na sake saita kalmar wucewa

source: Send Updates
ha: Aika Sabuntawa

source: Send username
ha: Aika da sunan mai amfani

source: Sensible Settings
ha: Saituna Masu Ma'ana

source: Sent Message
ha: Aika Saƙo

source: Sent Messages
ha: Saƙwannin da aka Aika

source: Setting a date and time on your Firefox OS phone
ha: Saita kwanan wata da lokaci a wayarka ta Firefox OS

source: Set up email
ha: Saita imel

source: Share Data
ha: Raba Bayani

source: Share this article: {link}
ha: Raba wannan maƙala: {link}

source: Share web pages on Firefox for iOS
ha: Raba shafukan yanar gizo a Firefox domin iOS

source: Share your wisdom with the world.
ha: Raba dabararka tare da sauran duniya.

source: Show:
ha: Nuna:

source: Show after
ha: Nuna bayan

source: Show All
ha: Nuna Duka

source: Show all questions
ha: Nuna duk tambayoyi

source: Show details &raquo;
ha: Nuna cikakken bayani &raquo;

source: Show Everything
ha: Nuna Komai

source: Show Helpfulness Votes Chart
ha: Nuna Taswirar Ƙuri'ar Taimakawa

source: Show History
ha: Nuna Tarihi

source: Show information for:
ha: Nuna bayani domin:

source: Showing questions tagged:
ha: Nuna amsoshi da aka yiwa shaida:

source: Show less
ha: Nuna kaɗan

source: Show me
ha: Nuna min

source: Show media for:
ha: Nuna kiɗa domin:

source: Show more
ha: Nuna mai yawa

source: Show translations
ha: Nuna fassarori

source: Show Translations
ha: Nuna Fassarori

source: Show translations | {document}
ha: Nuna fassarori | {document}

source: Show until
ha: Nuna har sai

source: Signed in!
ha: An shiga!

source: Significance:
ha: Amfani:

source: Significance - MT: Major Content Changes. M: Content Changes. Empty: Minor Changes.
ha: Mahimmanci - MT: Manya-manya Canje-canje na Abin ciki. M: Canje-canje na Abin ciki. Babu Komai: Ƙananan Canje-canje.

source: Sign in and connect to Twitter
ha: Shiga kuma ka haɗa zuwa Twitter

source: Signing in...
ha: shiga...

source: Sign in to Mozilla Support
ha: Shiga zuwa Tallafin Mozilla

source: Sign out
ha: Fita

source: Sign up as a volunteer
ha: Shiga a matsayin ɗan sa-kai

source: "%s" is too large (%sKB), the limit is %sKB
ha: "%s" ya yi girma sosai (%sKB), iyakacinsa shi ne %sKB

source: Sit back and relax. Our forum contributors will get back to you with an answer.
ha: Zauna ka huta. Masu bayar da gudun mawa na dandalinmu za su komo gareka da amsa.

source: {sitename} Password Reset
ha: {sitename} An sake saita Kalamar Wucewa

source: Sites Affected
ha: Dandalin da ya shafa

source: Skip to main content
ha: Tsallaka zuwa babban abin da ke ciki

source: Skip to search
ha: Tsallaka zuwa nema

source: Slowness or hanging
ha: Rashin sauri ko maƙalewa

source: Slug:
ha: Tsari:

source: Slug in {locale}:
ha: Tsari a {locale}:

source: solution
ha: mafita

source: Solution chosen
ha: An zaɓi mafita

source: Solution chosen by {user}
ha: An zaɓi mafita daga {user}

source: Solution didn't work
ha: Mafita ba ta yi aiki ba

source: Solution found for question: %s
ha: An sami mafita ga tambaya ta: %s

source: Solution found to Firefox Help question
ha: An sami mafita zuwa tambaya ta Taimakon Firefox

source: Solution provided
ha: An bayar da mafita

source: solved
ha: An warware

source: Solved
ha: An warware

source: % Solved
ha: An warware %

source: Solved the problem
ha: Warware matsala

source: Solves the problem
ha: Warware matsalar

source: Solving 1 issue helps up to 1,000 users a day
ha: Warware matsala 1 na taimakawa har zuwa masu amfani 1,000 a rana

source: Solving 1 issue helps up to 1,000 users a day!
ha: Warware matsala 1 na taimakawa masu amfani 1,000 a wuni!

source: Some features on this page are temporarily disabled while we perform website maintenance. Please try again a little later.
ha: Wasu kamanni na wannan shafi an dakatar da su na wani lokaci yayin da muke gyara a dandalinmu na yanar gizo. Sake jarrabawa nan da wani ɗan lokaci.

source: Some text will appear in the empty box.
ha: Wani rubutu zai fito a cikin akwatin wadda babu komai.

source: Something is wrong
ha: Wani abu bai yi dai dai ba

source: Sorry! Search is currently unavailable. Please try again soon.
ha: Yi haƙuri! Babu bincike yanzu. Sake jarrabawa ba da jimawa ba.

source: Sorry to hear that.
ha: Bamu ji daɗin jin haka ba.

source: Sorry, we couldn't find the page you were looking for. Please, try searching our site using the form below.
ha: Yi haƙuri, ba mu sami shafin da ka ke nema ba. Jarraba neman dandalinmu ta amfani da fom na ƙasa.

source: Sort options
ha: Zaɓin tantancewa

source: Sort results by
ha: Tantance sakamako ta

source: Source Code
ha: Tushen Lamba

source: Spam or other unrelated content
ha: Wasiƙa gayyar-soɗi ko abin da ciki marar dangantaka

source: <span class="key">Accessibility</span>: No
ha: <span class="key">Samun dama</span>: A'a

source: <span class="key">Accessibility</span>: Yes
ha: <span class="key">Samun dama</span>: E

source: <span class="key">User JS</span>: No
ha: <span class="key">Mai amfani JS</span>: A'a

source: <span class="key">User JS</span>: Yes
ha: <span class="key">Mai amfani JS</span>: E

source: %s posted an answer to your question "%s"
ha: %s an aika amsa zuwa tambayarka "%s"

source: Stale
ha: Daɗaɗɗe

source: Start
ha: Farawa

source: Start:
ha: Fara:

source: Start answering!
ha: Fara amsawa!

source: Status
ha: Matsayi

source: Stay in touch
ha: Mu ci gaba da ganawa

source: Stay up to date with news feeds, blogs and social features
ha: Zamo cikin sabunta tare da wurin samun labarai, blogs da siffofi na zamantakewa

source: Sticky
ha: Mai danƙo

source: Sticky this thread
ha: Liƙe wannan tattaunawa

source: Stop article emails
ha: Tsayar da imel na maƙala

source: Stop email updates
ha: Tsayar da sabunta imel

source: Stop Ignoring
ha: Tsayar da Watsarwa

source: Stop receiving updates via email for this question.
ha: Daina samun sabuntawa ta hanyar imel domin wannan tambayar.

source: Stop watching this forum
ha: Daina kallon wannan dandali

source: Stop watching this locale
ha: Daina kallon wannan wurin

source: Stop watching this thread
ha: Daina kallon wannan tattaunawa

source: <strong>0</strong> questions in the last <strong>24 hours</strong> have no reply. <strong>Good job!</strong>
ha: <strong>0</strong> tambayoyi a ƙarshen <strong>24 hours</strong> basu da amsa. <strong>Aiki mai kyau!</strong>

source: <strong>%(awarder)s</strong> has awarded you the <strong>%(title)s</strong> badge!
ha: <strong>%(awarder)s</strong> ya baka <strong>%(title)s</strong> bajo!

source: <strong>{product}</strong> Support Forum
ha: <strong>{product}</strong> Dandalin Tallafi

source: <strong>%(recent_unanswered_count)s question</strong> has no reply.
ha: <strong>%(recent_unanswered_count)s tambaya</strong> ba ta da amsa.

source: <strong>%(recent_unanswered_count)s</strong> question in the last <strong>24 hours</strong> has no reply. <a href="%(url)s">Help solve it!</a>
ha: <strong>%(recent_unanswered_count)s</strong> tambaya a ƙarshen <strong>24 hours</strong> bata da amsa. <a href="%(url)s">Taimaka ka warwareta!</a>

source: <strong>Warning:</strong> Accounts created before December 2010 may have issues logging in. Please reset your password below.
ha: <strong>Gargaɗi:</strong> Asusun da aka ƙirƙira kafin watan Disamba 2010 na iya samun matsala wajen shiga. Sake saita kalmar wucewarka a ƙasa.

source: <strong>Warning:</strong> This revision has KB Helpfulness Votes associated with it. Deleting this revision will cause those votes to be deleted as well.
ha: <strong>Gargaɗi:</strong> Wannan nazarin yana da KB na Ƙuri'un Taimakawa tare da shi. Goge wannan nazari na iya sakawa waɗan nan ƙuri'u haka su ma su goge.

source: Subject:
ha: Batu:

source: Submit for Review
ha: Miƙawa domin Sake Nazari

source: Submit Issue
ha: Aika Batu

source: Submitted {locale} translation:
ha: Miƙa {locale} fassara:

source: Submitted revision:
ha: Nazari wanda aka miƙa:

source: Submitted Revision Changes
ha: Canje-canje waɗanda aka Miƙa

source: Submitted translation:
ha: Fassarar da aka miƙa:

source: Submitted Translation Changes
ha: Miƙa Canje-canjen Fassara

source: Submit Your Changes
ha: Miƙa Canje-canjenka

source: Subscribe...
ha: Yi sautu...

source: Subscribe to edit notifications
ha: Yi sautu zuwa sanarwar gyara

source: Subscribe to feed
ha: Yi sautu zuwa ƙarfin wuta

source: Subscription confirmed.
ha: An tabbatar da sautu.

source: Successfully activated
ha: An yi nasarar farfaɗowa

source: Summarize your question in a sentence
ha: Taƙaita tambayarka a layi guda

source: Summary:
ha: Taƙaitacce:

source: [SUMO] You have a new private message from [{sender}]
ha: [SUMO] Kana da saƙo na ka na kanka daga [{sender}]

source: Support article:
ha: Tallafawa maƙala:

source: Support Forum
ha: Dandalin Tallafi

source: Support Forum Home
ha: Tallafawa Gidan Dandali

source: Support Forum Metrics
ha: Lambobi na Dandalin Tallafi

source: Support Questions
ha: Tambayoyin Tallafi

source: Support URL: {support_url}
ha: URL na tallafawa: {support_url}

source: Switch language
ha: Canja yare

source: Switch to desktop site
ha: Koma zuwa dandalin fuskar kwamfuta

source: Switch to edit mode
ha: Canja zuwa yanayin gyara

source: Switch to mobile site
ha: Koma zuwa dandalin wayar hannu

source: Switch to preview mode
ha: Canja zuwa yanayin misali

source: sync
ha: tsarawa

source: System
ha: Na'ura

source: System Details
ha: Cikakken Bayanin Na'ura

source: Systems and Languages
ha: Tsare-tsare da Yaruka

source: Tab basics
ha: Asalin madanni

source: Table of Contents
ha: Abubuwan da ke Ciki

source: Tabs
ha: Madannai

source: Tab settings
ha: Saitunan madanni

source: tag1, tag2
ha: shaida ta1, shaida ta2

source: Tags
ha: Alamomi

source: Take Action:
ha: Ɗauki Mataki:

source: Take pictures, record videos and listen to music on your Firefox OS phone.
ha: Ɗauki hotuna, ɗauki bidiyoyi kuma ka saurari kiɗa a kan wayarka ta Firefox OS.

source: Tap here to go to the mobile version of the site.
ha: Danna nan domin zuwa yayin wayar hannu na dandalin.

source: {t} | {d} Discussion | Knowledge Base
ha: {t} | {d} Tattaunawa | Tushen Ilimi

source: Tell us about yourself!
ha: Yi mana bayani a kanka!

source: Tell us more.
ha: Ƙara mana bayani.

source: Templates
ha: Allon misali

source: Templates are a way of reusing pieces of content across KB articles. You can create and update a set of instructions in one place, and then refer to it in other pages.
ha: Allon misali wata hanya ce ta sake amfani da abin ciki a gaba ɗayan maƙalolin KB. Za ka iya ƙirƙira kuma ka sabunta saita dokoki a waje guda, sannan ka sake komawa gareshi a wasu shafukan.

source: Text of the new revision:
ha: Rubutun sabon nazari:

source: Thanks,
ha: Godiya,

source: Thanks!
ha: Na gode!

source: Thanks for joining Mozilla Support! To complete registration, you need to verify your email address.
ha: Godiya domin shiga Tallafin Mozilla! Domin kammala rijista, ka na bukatar tantance adireshinka na imel.

source: Thanks for letting us know you have this problem.
ha: Mun gode da ka sanar da mu cewa kana da wannan matsalar.

source: Thanks for making us better!
ha: Mun gode sabo da mayar da mu ingantattu!
